Tekla Open API Reference for Tekla Structures 2025
TeklaDrawingColor Constructor
 Default constructor for the struct. Assigns color to standard black.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TeklaDrawingColor()
Public Sub New
See Also
Reference
TeklaDrawingColor Structure
TeklaDrawingColor Overload
Tekla.Structures.Drawing Namespace